psychoStark/ESP32-SwitchBot/main/calibration.h
#pragma once
#include <Arduino.h>
#include <WebServer.h>
#include <ESP32Servo.h>
#include <Preferences.h>
#include "web_pages.h"

// Default servo calibration metrics as requested: rest: 0, press: 10, duration: 200
static const int DEFAULT_REST_ANGLE = 0;
static const int DEFAULT_PRESS_ANGLE = 10;
static const int DEFAULT_PRESS_DURATION_MS = 200;

// Shared global state (defined in main.cpp)
extern Servo myservo;
extern const int servoPin;
extern int restAngle;
extern int pressAngle;
extern int pressDurationMs;
extern bool isCalibrated;
extern Preferences prefs;

/**
 * @brief Load calibration data from NVS namespace "servo_cal"
 */
inline void loadCalibration() {
  prefs.begin("servo_cal", true);
  isCalibrated = prefs.getBool("calibrated", false);
  if (isCalibrated) {
    restAngle = prefs.getInt("rest_angle", DEFAULT_REST_ANGLE);
    pressAngle = prefs.getInt("press_angle", DEFAULT_PRESS_ANGLE);
    pressDurationMs = prefs.getInt("press_dur", DEFAULT_PRESS_DURATION_MS);
  } else {
    restAngle = DEFAULT_REST_ANGLE;
    pressAngle = DEFAULT_PRESS_ANGLE;
    pressDurationMs = DEFAULT_PRESS_DURATION_MS;
  }
  prefs.end();
}

/**
 * @brief Save calibration metrics to NVS and mark device calibrated
 */
inline bool saveCalibration(int rest, int press, int dur) {
  if (rest < -180 || rest > 180 || press < -180 || press > 180 || dur < 50 || dur > 5000) {
    return false;
  }
  restAngle = rest;
  pressAngle = press;
  pressDurationMs = dur;
  isCalibrated = true;

  prefs.begin("servo_cal", false);
  prefs.putBool("calibrated", true);
  prefs.putInt("rest_angle", restAngle);
  prefs.putInt("press_angle", pressAngle);
  prefs.putInt("press_dur", pressDurationMs);
  prefs.end();

  // Ensure servo rests at the new rest angle
  myservo.attach(servoPin, 500, 2400);
  myservo.write(restAngle);
  delay(300);
  myservo.detach();

  return true;
}

/**
 * @brief Reset calibration data in NVS and restore initial uncalibrated defaults
 */
inline void resetCalibration() {
  prefs.begin("servo_cal", false);
  prefs.clear();
  prefs.end();

  isCalibrated = false;
  restAngle = DEFAULT_REST_ANGLE;
  pressAngle = DEFAULT_PRESS_ANGLE;
  pressDurationMs = DEFAULT_PRESS_DURATION_MS;

  myservo.attach(servoPin, 500, 2400);
  myservo.write(restAngle);
  delay(300);
  myservo.detach();
}

/**
 * @brief Generate the bash script served to curl clients for interactive calibration
 */
inline String generateCurlCalibrateScript(const String &host) {
  String script = F(R"raw(#!/bin/bash
HOST="{{HOST}}"
LIVE=$(curl -s http://$HOST/api/live 2>/dev/null)
CUR_CAL=$(echo "$LIVE" | grep -o '"cal":[01]' | cut -d: -f2)
CUR_REST=$(echo "$LIVE" | grep -o '"s_rest":[-0-9]*' | cut -d: -f2)
CUR_PRESS=$(echo "$LIVE" | grep -o '"s_press":[-0-9]*' | cut -d: -f2)
CUR_DUR=$(echo "$LIVE" | grep -o '"s_dur":[0-9]*' | cut -d: -f2)
if [[ -z "$CUR_REST" ]]; then CUR_REST=0; fi
if [[ -z "$CUR_PRESS" ]]; then CUR_PRESS=10; fi
if [[ -z "$CUR_DUR" ]]; then CUR_DUR=200; fi
ORIG_REST=$CUR_REST
REST=$CUR_REST
PRESS=$CUR_PRESS
DUR=$CUR_DUR
while true; do
  clear
  echo '=========================================='
  echo '      SERVO CALIBRATION TOOL (ESP32)      '
  echo '=========================================='
  if [[ "$CUR_CAL" == "1" ]]; then
    echo ' Status: CALIBRATED'
  else
    echo ' Status: UNCALIBRATED (Initial Setup)'
  fi
  echo " Current Config: Rest=${REST}° | Press=${PRESS}° | Duration=${DUR}ms"
  echo '=========================================='
  echo ''
  while true; do
    echo '[ Step 1/3: Rest Angle ] (Hovering just above button)'
    read -p "Enter rest angle (-180 to 180, 'q' to cancel) [$REST]: " input </dev/tty
    if [[ "$input" == "q" || "$input" == "Q" ]]; then
      echo '[*] Cancelling calibration... returning servo to saved rest position.'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Calibration cancelled.'
      exit 0
    fi
    if [[ -n "$input" ]]; then
      if [[ "$input" =~ ^-?[0-9]+$ ]] && [ "$input" -ge -180 ] && [ "$input" -le 180 ]; then
        REST=$input
      else
        echo '[!] Invalid angle. Enter a number between -180 and 180.'
        continue
      fi
    fi
    curl -s -X POST "http://$HOST/api/calibrate/move?angle=$REST" >/dev/null
    echo "[+] Servo driven to ${REST}°."
    conf=""
    read -n 1 -s -p "Confirm rest angle (${REST}°)? [y: next / n: retry / q: cancel]: " conf </dev/tty
    echo ''
    if [[ "$conf" == "q" || "$conf" == "Q" ]]; then
      echo '[*] Cancelling calibration... returning servo to saved rest position.'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Calibration cancelled.'
      exit 0
    fi
    if [[ "$conf" == "y" || "$conf" == "Y" ]]; then break; fi
  done
  echo ''
  while true; do
    echo '[ Step 2/3: Press Angle ] (Pushing button fully, not buzzing)'
    read -p "Enter press angle (-180 to 180, 'q' to cancel) [$PRESS]: " input </dev/tty
    if [[ "$input" == "q" || "$input" == "Q" ]]; then
      echo '[*] Cancelling calibration... returning servo to saved rest position.'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Calibration cancelled.'
      exit 0
    fi
    if [[ -n "$input" ]]; then
      if [[ "$input" =~ ^-?[0-9]+$ ]] && [ "$input" -ge -180 ] && [ "$input" -le 180 ]; then
        PRESS=$input
      else
        echo '[!] Invalid angle. Enter a number between -180 and 180.'
        continue
      fi
    fi
    curl -s -X POST "http://$HOST/api/calibrate/move?angle=$PRESS" >/dev/null
    echo "[+] Servo driven to ${PRESS}°."
    conf=""
    read -n 1 -s -p "Confirm press angle (${PRESS}°)? [y: next / n: retry / q: cancel]: " conf </dev/tty
    echo ''
    if [[ "$conf" == "q" || "$conf" == "Q" ]]; then
      echo '[*] Cancelling calibration... returning servo to saved rest position.'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Calibration cancelled.'
      exit 0
    fi
    if [[ "$conf" == "y" || "$conf" == "Y" ]]; then
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$REST" >/dev/null
      break
    fi
  done
  echo ''
  while true; do
    echo '[ Step 3/3: Press Duration ] (Hold duration in ms)'
    read -p "Enter press duration (50-3000 ms, 'q' to cancel) [$DUR]: " input </dev/tty
    if [[ "$input" == "q" || "$input" == "Q" ]]; then
      echo '[*] Cancelling calibration... returning servo to saved rest position.'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Calibration cancelled.'
      exit 0
    fi
    if [[ -n "$input" ]]; then
      if [[ "$input" =~ ^[0-9]+$ ]] && [ "$input" -ge 50 ] && [ "$input" -le 3000 ]; then
        DUR=$input
      else
        echo '[!] Invalid duration. Enter a number between 50 and 3000.'
        continue
      fi
    fi
    echo "[*] Executing tap for $DUR ms (Rest: ${REST}°, Press: ${PRESS}°)..."
    curl -s -X POST "http://$HOST/api/calibrate/test?rest=$REST&press=$PRESS&dur=$DUR" >/dev/null
    echo '[+] Tap test complete.'
    conf=""
    read -n 1 -s -p "Confirm press duration ($DUR ms)? [y: next / n: retry / q: cancel]: " conf </dev/tty
    echo ''
    if [[ "$conf" == "q" || "$conf" == "Q" ]]; then
      echo '[*] Cancelling calibration... returning servo to saved rest position.'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Calibration cancelled.'
      exit 0
    fi
    if [[ "$conf" == "y" || "$conf" == "Y" ]]; then break; fi
  done
  echo ''
  while true; do
    clear
    echo '=========================================='
    echo '       CALIBRATION REVIEW & ACTIONS       '
    echo '=========================================='
    echo " Rest Angle     : ${REST}°"
    echo " Press Angle    : ${PRESS}°"
    echo " Press Duration : ${DUR} ms"
    echo '------------------------------------------'
    echo ' [S] Save Calibration'
    echo ' [T] Test Again'
    echo ' [V] Type in Another Value'
    echo ' [C] Restart Whole Calibration'
    echo ' [R] Clear Calibration Data'
    echo ' [X] Exit without Saving'
    echo '=========================================='
    opt=""
    read -n 1 -s -p "Select an option: " opt </dev/tty
    echo ''
    if [[ "$opt" == "s" || "$opt" == "S" ]]; then
      echo '[*] Saving calibration data to ESP32...'
      curl -s -X POST "http://$HOST/api/calibrate/save?rest=$REST&press=$PRESS&dur=$DUR"
      echo -e '\n[+] Calibration saved successfully!\n'
      sleep 1.5
      exit 0
    elif [[ "$opt" == "t" || "$opt" == "T" ]]; then
      echo '[*] Running test tap...'
      curl -s -X POST "http://$HOST/api/calibrate/test?rest=$REST&press=$PRESS&dur=$DUR"
      echo '[+] Test completed.'
      sleep 1
    elif [[ "$opt" == "v" || "$opt" == "V" ]]; then
      echo ''
      echo 'Select metric to change:'
      echo " [1] Rest Angle (${REST}°)"
      echo " [2] Press Angle (${PRESS}°)"
      echo " [3] Press Duration (${DUR} ms)"
      echo ' [B] Back to Review'
      vopt=""
      read -n 1 -s -p 'Select metric: ' vopt </dev/tty
      echo ''
      if [[ "$vopt" == "1" ]]; then
        read -p "Enter new Rest Angle (-180 to 180) [$REST]: " nval </dev/tty
        if [[ "$nval" =~ ^-?[0-9]+$ ]] && [ "$nval" -ge -180 ] && [ "$nval" -le 180 ]; then
          REST=$nval
          curl -s -X POST "http://$HOST/api/calibrate/move?angle=$REST" >/dev/null
          echo "[+] Servo moved to ${REST}°."
          sleep 1
        fi
      elif [[ "$vopt" == "2" ]]; then
        read -p "Enter new Press Angle (-180 to 180) [$PRESS]: " nval </dev/tty
        if [[ "$nval" =~ ^-?[0-9]+$ ]] && [ "$nval" -ge -180 ] && [ "$nval" -le 180 ]; then
          PRESS=$nval
          curl -s -X POST "http://$HOST/api/calibrate/move?angle=$PRESS" >/dev/null
          echo "[+] Servo moved to ${PRESS}°."
          sleep 1
          curl -s -X POST "http://$HOST/api/calibrate/move?angle=$REST" >/dev/null
        fi
      elif [[ "$vopt" == "3" ]]; then
        read -p "Enter new Press Duration (50-3000 ms) [$DUR]: " nval </dev/tty
        if [[ "$nval" =~ ^[0-9]+$ ]] && [ "$nval" -ge 50 ] && [ "$nval" -le 3000 ]; then
          DUR=$nval
          curl -s -X POST "http://$HOST/api/calibrate/test?rest=$REST&press=$PRESS&dur=$DUR" >/dev/null
          echo '[+] Tap test complete.'
          sleep 1
        fi
      fi
    elif [[ "$opt" == "c" || "$opt" == "C" ]]; then
      break
    elif [[ "$opt" == "r" || "$opt" == "R" ]]; then
      rconf=""
      read -n 1 -s -p 'Are you sure you want to clear calibration data? [y/N]: ' rconf </dev/tty
      echo ''
      if [[ "$rconf" == "y" || "$rconf" == "Y" ]]; then
        curl -s -X POST "http://$HOST/api/calibrate/reset"
        echo -e '\n[+] Calibration data cleared. Device reset to uncalibrated.\n'
        sleep 1.5
        exit 0
      fi
    elif [[ "$opt" == "x" || "$opt" == "X" ]]; then
      echo '[*] Returning servo to saved rest position...'
      curl -s -X POST "http://$HOST/api/calibrate/move?angle=$ORIG_REST" >/dev/null
      echo 'Exiting calibration.'
      exit 0
    fi
  done
done
)raw");
  script.replace("{{HOST}}", host);
  return script;
}

/**
 * @brief Generate the HTML calibration page for web browsers
 */
inline String generateCalibratePage(int curRest, int curPress, int curDur, bool calibrated) {
  String statusBadge = calibrated 
    ? "<span class='pill on'>Calibrated</span>" 
    : "<span class='pill warn'>Initial Setup Needed</span>";

  String backLinkHtml = calibrated 
    ? "<a class='back' href='/main'>&larr; Back to Dashboard</a>" 
    : "";

