psychoStark/ESP32-SwitchBot/main/calibration.h
  String revertBtnHtml = calibrated
    ? "<button type='button' id='btn-revert' title='Revert to saved metrics'><svg width='15' height='15' viewBox='0 0 24 24' fill='none' stroke='currentColor' stroke-width='2.2' stroke-linecap='round' stroke-linejoin='round'><path d='M3 12a9 9 0 1 0 9-9 9.75 9.75 0 0 0-6.74 2.74L3 8'/><path d='M3 3v5h5'/></svg></button>"
    : "";

  String body;
  body.reserve(4096);

  body += "<style>"
          ".cal-header-row{display:flex;justify-content:space-between;align-items:center;margin:28px 0 10px;}"
          ".cal-header-row h3{margin:0;padding:0;}"
          "#btn-revert{width:28px !important;min-width:28px !important;max-width:28px !important;height:28px !important;min-height:28px !important;max-height:28px !important;padding:0 !important;margin:0 !important;background:none !important;border:none !important;color:var(--on-surface-v);cursor:pointer;border-radius:50% !important;display:inline-flex;align-items:center;justify-content:center;box-shadow:none !important;backdrop-filter:none !important;-webkit-backdrop-filter:none !important;transition:color .25s ease,transform .35s cubic-bezier(0.4,0,0.2,1);outline:none;}"
          "#btn-revert:hover{color:var(--primary) !important;background:none !important;box-shadow:none !important;transform:rotate(-360deg);}"
          "#btn-revert:active{transform:scale(0.85) rotate(-360deg);}"
          ".dial-grid{display:flex;justify-content:space-around;align-items:flex-start;gap:12px;padding:22px 14px 16px;border-bottom:1px solid rgba(255,255,255,0.06);flex-wrap:wrap;}"
          ".dial-box{flex:1;min-width:140px;max-width:240px;display:flex;flex-direction:column;align-items:center;text-align:center;}"
          ".dial-title{font-size:14px;font-weight:600;color:var(--on-surface);margin-bottom:2px;}"
          ".dial-sub{font-size:11px;color:var(--on-surface-v);margin-bottom:12px;white-space:nowrap;}"
          ".dial-svg-wrap{position:relative;width:150px;height:150px;touch-action:none;user-select:none;-webkit-user-select:none;cursor:grab;}"
          ".dial-svg-wrap:active{cursor:grabbing;}"
          ".dial-svg{width:100%;height:100%;overflow:visible;}"
          ".dial-bg{fill:none;stroke:rgba(255,255,255,0.08);stroke-width:8;stroke-linecap:round;}"
          ".dial-bar{fill:none;stroke:var(--primary);stroke-width:8;stroke-linecap:round;filter:drop-shadow(0 0 6px rgba(138,180,248,0.35));}"
          ".dial-thumb{fill:#ffffff;stroke:var(--primary);stroke-width:3.5;filter:drop-shadow(0 0 5px rgba(138,180,248,0.6));transition:transform .1s ease;}"
          ".dial-center{position:absolute;top:50%;left:50%;transform:translate(-50%,-50%);display:flex;align-items:center;justify-content:center;pointer-events:auto;}"
          ".dial-badge{display:inline-flex;align-items:center;justify-content:center;background:var(--surface-c);border:1px solid var(--surface-border);border-radius:12px;padding:4px 10px;min-width:64px;box-shadow:inset 0 1px 3px rgba(0,0,0,0.35);transition:border-color .2s,box-shadow .2s;cursor:text;}"
          ".dial-badge:focus-within{border-color:var(--primary);box-shadow:0 0 10px rgba(138,180,248,0.25);}"
          ".cal-dial-input{background:transparent !important;border:none !important;color:var(--primary);font-family:'SF Mono',Menlo,Consolas,monospace;font-size:17px;font-weight:700;padding:0 !important;margin:0 !important;text-align:center !important;min-width:1.2ch;max-width:5ch;field-sizing:content;outline:none;-webkit-appearance:none;-moz-appearance:textfield;appearance:none;line-height:1.2;}"
          ".cal-dial-input::-webkit-inner-spin-button,.cal-dial-input::-webkit-outer-spin-button{-webkit-appearance:none;margin:0;}"
          ".dial-deg{font-size:13px;font-weight:700;color:var(--primary);opacity:0.85;margin-left:1px;line-height:1.2;user-select:none;-webkit-user-select:none;}"
          ".dial-limits{position:absolute;bottom:2px;left:0;right:0;display:flex;justify-content:space-between;padding:0 10px;font-size:9.5px;color:var(--on-surface-v);pointer-events:none;font-family:'SF Mono',Menlo,monospace;}"
          ".cal-row{display:flex;flex-direction:column;align-items:stretch;padding:16px 20px;border-bottom:1px solid rgba(255,255,255,0.06);transition:background .2s ease;margin:0;}"
          ".cal-row:first-child{border-top-left-radius:19px;border-top-right-radius:19px;}"
          ".cal-row:last-child{border-bottom:none;border-bottom-left-radius:19px;border-bottom-right-radius:19px;}"
          ".cal-row:hover{background:rgba(138,180,248,0.05);}"
          ".cal-num-box{display:inline-flex;align-items:center;background:var(--surface-c);border:1px solid var(--surface-border);border-radius:10px;padding:3px 8px;box-shadow:inset 0 1px 3px rgba(0,0,0,0.3);}"
          ".cal-num-box:focus-within{border-color:var(--primary);box-shadow:0 0 10px rgba(138,180,248,0.25);}"
          ".cal-num-raw{background:transparent !important;border:none !important;color:var(--primary);font-family:'SF Mono',Menlo,Consolas,monospace;font-size:14px;font-weight:700;padding:0 !important;margin:0 !important;text-align:right;width:48px;outline:none;-moz-appearance:textfield;appearance:textfield;}"
          ".cal-num-raw::-webkit-inner-spin-button,.cal-num-raw::-webkit-outer-spin-button{-webkit-appearance:none;margin:0;}"
          ".cal-slider{-webkit-appearance:none !important;appearance:none !important;width:100% !important;height:6px !important;background:rgba(255,255,255,0.1);border-radius:3px !important;outline:none !important;margin:8px 0 !important;padding:0 !important;cursor:pointer !important;touch-action:pan-y !important;}"
          ".cal-slider::-webkit-slider-runnable-track{width:100%;height:6px;background:transparent;border-radius:3px;border:none;}"
          ".cal-slider::-webkit-slider-thumb{-webkit-appearance:none !important;appearance:none !important;height:18px;width:18px;border-radius:50%;background:#ffffff;border:2px solid var(--primary);box-shadow:0 0 8px rgba(138,180,248,0.6);cursor:pointer;margin-top:-6px;transition:transform .15s ease,box-shadow .15s ease;}"
          ".cal-slider::-webkit-slider-thumb:active{transform:scale(1.2);box-shadow:0 0 14px rgba(138,180,248,0.9);}"
          ".cal-slider::-moz-range-track{width:100%;height:6px;background:rgba(255,255,255,0.1);border-radius:3px;border:none;}"
          ".cal-slider::-moz-range-thumb{height:18px;width:18px;border-radius:50%;background:#ffffff;border:2px solid var(--primary);box-shadow:0 0 8px rgba(138,180,248,0.6);cursor:pointer;border:none;}"
          ".btn-hold{width:100%;background:linear-gradient(135deg,rgba(138,180,248,0.18) 0%,rgba(59,130,246,0.1) 100%);border:2px solid rgba(138,180,248,0.38);color:var(--primary);font-size:14.5px;font-weight:700;height:54px;border-radius:27px;user-select:none;-webkit-user-select:none;touch-action:none;display:inline-flex;align-items:center;justify-content:center;gap:10px;cursor:pointer;transition:all .15s ease;}"
          ".btn-hold.holding{background:linear-gradient(135deg,rgba(52,211,153,0.35) 0%,rgba(16,185,129,0.2) 100%) !important;border-color:var(--success) !important;color:var(--success) !important;box-shadow:0 0 25px rgba(52,211,153,0.45) !important;transform:scale(0.97);}"
          "</style>";

