psychoStark/ESP32-SwitchBot/main/calibration.h
  body += "<h1>&#127919; Servo Calibration</h1>";
  body += "<div style='text-align:center;margin-bottom:20px;'>" + statusBadge + "</div>";
  body += "<div class='cal-header-row'><h3>Configuration Metrics</h3>" + revertBtnHtml + "</div>";
  body += "<div class='card' style='padding:0;overflow:hidden;'>";

  // Circular Dials Row for Rest and Press Angles
  body += "<div class='dial-grid no-copy'>";

  // Rest Angle Dial
  body += "<div class='dial-box' id='rest-dial-box'>";
  body += "<div class='dial-title'>Rest Angle</div>";
  body += "<div class='dial-sub'>Hovering just above button</div>";
  body += "<div class='dial-svg-wrap' id='rest-dial-wrap'>";
  body += "<svg class='dial-svg' viewBox='0 0 160 160'>";
  body += "<path class='dial-bg' d='M 60.16 134.50 A 58 58 0 1 1 99.84 134.50'/>";
  body += "<path class='dial-bar' id='rest-dial-bar' d=''/>";
  body += "<circle class='dial-thumb' id='rest-dial-thumb' cx='80' cy='22' r='8.5'/>";
  body += "</svg>";
  body += "<div class='dial-center'>";
  body += "<div class='dial-badge'>";
  body += "<input type='text' inputmode='numeric' pattern='-?[0-9]*' id='rest-num' value='" + String(curRest) + "' class='cal-dial-input' style='width:" + String(String(curRest).length() + 0.2) + "ch;'>";
  body += "<span class='dial-deg'>&deg;</span>";
  body += "</div></div>";
  body += "<div class='dial-limits'>";
  body += "<span>-180&deg;</span><span>+180&deg;</span>";
  body += "</div></div></div>";

  // Press Angle Dial
  body += "<div class='dial-box' id='press-dial-box'>";
  body += "<div class='dial-title'>Press Angle</div>";
  body += "<div class='dial-sub'>Pushing button fully</div>";
  body += "<div class='dial-svg-wrap' id='press-dial-wrap'>";
  body += "<svg class='dial-svg' viewBox='0 0 160 160'>";
  body += "<path class='dial-bg' d='M 60.16 134.50 A 58 58 0 1 1 99.84 134.50'/>";
  body += "<path class='dial-bar' id='press-dial-bar' d=''/>";
  body += "<circle class='dial-thumb' id='press-dial-thumb' cx='80' cy='22' r='8.5'/>";
  body += "</svg>";
  body += "<div class='dial-center'>";
  body += "<div class='dial-badge'>";
  body += "<input type='text' inputmode='numeric' pattern='-?[0-9]*' id='press-num' value='" + String(curPress) + "' class='cal-dial-input' style='width:" + String(String(curPress).length() + 0.2) + "ch;'>";
  body += "<span class='dial-deg'>&deg;</span>";
  body += "</div></div>";
  body += "<div class='dial-limits'>";
  body += "<span>-180&deg;</span><span>+180&deg;</span>";
  body += "</div></div></div>";

  body += "</div>"; // End dial-grid

  // Press Duration Row (below dials)
  body += "<div class='cal-row no-copy'>";
  body += "<div style='display:flex;justify-content:space-between;align-items:center;margin-bottom:6px;'>";
  body += "<div><div style='font-size:14px;font-weight:600;color:var(--on-surface);'>Press Duration</div>";
  body += "<div style='font-size:11.5px;color:var(--on-surface-v);'>Hold duration during tap</div></div>";
  body += "<div class='cal-num-box'>";
  body += "<input type='text' inputmode='numeric' pattern='[0-9]*' id='dur-num' value='" + String(curDur) + "' class='cal-num-raw'>";
  body += "<span style='font-size:12px;font-weight:600;color:var(--on-surface-v);margin-left:4px;'>ms</span>";
  body += "</div></div>";
  body += "<div style='margin-top:4px;'>";
  body += "<input type='range' id='dur-range' min='50' max='3000' step='10' value='" + String(curDur) + "' class='cal-slider'>";
  body += "</div></div>";

  body += "</div>"; // End card

  // Custom Live Press & Hold Button (SEPARATE CARD)
  body += "<h3>Live Manual Control</h3>";
  body += "<div class='card' style='padding:20px;text-align:center;'>";
  body += "<button type='button' id='btn-hold' class='btn-hold'>";
  body += "&#128071; Press &amp; Hold</button>";
  body += "<div style='font-size:12px;color:var(--on-surface-v);margin-top:12px;line-height:1.4;'>";
  body += "Hold to press servo live to Press Angle &bull; Release to return to Rest Angle</div>";
  body += "</div>";

  // Action Buttons: Save, Test, Reset (SEPARATED FROM PRESS & HOLD BUTTON)
  body += "<h3>Calibration Actions</h3>";
  body += "<div class='card' style='padding:18px 20px;'>";
  body += "<div class='actions' style='margin-top:0;margin-bottom:12px;'>";
  body += "<button type='button' id='btn-test' class='primary' style='background:rgba(138,180,248,0.16);color:var(--primary);'>&#9654; Test Tap</button>";
  body += "<button type='button' id='btn-save' style='background:rgba(52,211,153,0.18);border-color:rgba(52,211,153,0.35);color:var(--success);'>&#10004; Save</button>";
  body += "</div>";
  body += "<div class='actions' style='margin-top:0;'>";
  body += "<button type='button' id='btn-reset' class='danger'>&#128465; Reset Calibration</button>";
  body += "</div>";
  body += "</div>";

  body += backLinkHtml;

  String calScript = F(
    "<script>"
    "(function(){"
    "function initCal(){"
      "var savedRest={{REST}},savedPress={{PRESS}},savedDur={{DUR}};"
      "var hasSaved=false;"
      "var rNum=document.getElementById('rest-num');"
      "var pNum=document.getElementById('press-num');"
      "var dNum=document.getElementById('dur-num');"
      "var dRng=document.getElementById('dur-range');"
      "var holdBtn=document.getElementById('btn-hold');"
      "var testBtn=document.getElementById('btn-test');"
      "var saveBtn=document.getElementById('btn-save');"
      "var resetBtn=document.getElementById('btn-reset');"
      "var revertBtn=document.getElementById('btn-revert');"
      "if(!rNum||!pNum||!dNum||!dRng||!holdBtn||!testBtn||!saveBtn||!resetBtn)return;"

      "var lastDHaptic=dRng.value;"

      "function hapticTick(val,prevVal){"
        "if(val!==prevVal){"
          "if(navigator.vibrate){try{navigator.vibrate(6);}catch(e){}}"
        "}"
      "}"

      // Update linear slider gradient fill
      "function updateSliderFill(val){"
        "var pct=((val-50)/(3000-50))*100;"
        "dRng.style.background='linear-gradient(to right,var(--primary) 0%,var(--primary) '+pct+'%,rgba(255,255,255,0.1) '+pct+'%,rgba(255,255,255,0.1) 100%)';"
      "}"
      "updateSliderFill(parseInt(dRng.value,10)||savedDur);"

      // Debounced angle update for rest position
      "var mvTm=null;"
      "function moveLive(deg){"
        "clearTimeout(mvTm);"
        "mvTm=setTimeout(function(){fetch('/api/calibrate/move?angle='+deg,{method:'POST'}).catch(function(){});},75);"
      "}"

