psychoStark/ESP32-SwitchBot/main/calibration.h
      // Return servo to saved resting state on exit without saving
      "function returnToRest(){"
        "if(!hasSaved){"
          "fetch('/api/calibrate/move?angle='+savedRest,{method:'POST',keepalive:true}).catch(function(){});"
        "}"
      "}"
      "var backLink=document.querySelector('.back');"
      "if(backLink){backLink.addEventListener('click',function(){returnToRest();});}"
      "window.addEventListener('pagehide',returnToRest);"
      "window.addEventListener('beforeunload',returnToRest);"

      // Circular Dial Renderer
      "function setDial(type,angle){"
        "var bar=document.getElementById(type+'-dial-bar');"
        "var thumb=document.getElementById(type+'-dial-thumb');"
        "var num=document.getElementById(type+'-num');"
        "if(!bar||!thumb||!num)return;"
        "if(angle>180)angle=180;if(angle<-180)angle=-180;"
        "num.value=angle;"
        "num.style.width=(((''+angle).length+0.2)+'ch');"
        "var phi=(angle/180)*160;"
        "var rad=phi*(Math.PI/180);"
        "var x=(80+58*Math.sin(rad)).toFixed(2);"
        "var y=(80-58*Math.cos(rad)).toFixed(2);"
        "thumb.setAttribute('cx',x);"
        "thumb.setAttribute('cy',y);"
        "if(Math.abs(angle)<0.5){bar.setAttribute('d','');}"
        "else if(angle>0){bar.setAttribute('d','M 80 22 A 58 58 0 0 1 '+x+' '+y);}"
        "else{bar.setAttribute('d','M 80 22 A 58 58 0 0 0 '+x+' '+y);}"
      "}"

      // Circular Dial Controller with Bottom Gap Barrier
      "function bindDial(type,isRest){"
        "var wrap=document.getElementById(type+'-dial-wrap');"
        "var num=document.getElementById(type+'-num');"
        "if(!wrap||!num)return;"
        "var dragging=false;"
        "var curAng=parseInt(num.value,10)||0;"
        "var lastHaptic=curAng;"

        "function getAngle(e){"
          "var rect=wrap.getBoundingClientRect();"
          "var cx=rect.left+rect.width/2;"
          "var cy=rect.top+rect.height/2;"
          "var cxEv=e.clientX,cyEv=e.clientY;"
          "if(e.touches&&e.touches.length>0){cxEv=e.touches[0].clientX;cyEv=e.touches[0].clientY;}"
          "var dx=cxEv-cx,dy=cyEv-cy;"
          "if(dx*dx+dy*dy<36)return curAng;"

          // Angle from 12 o'clock in degrees (-180 to +180)
          "var deg=Math.atan2(dx,-dy)*(180/Math.PI);"

          // Barrier Protection:
          // Prevent crossing the bottom gap from negative into positive
          "if(curAng<-80&&deg>80){return -180;}"
          // Prevent crossing the bottom gap from positive into negative
          "if(curAng>80&&deg<-80){return 180;}"

          // Gap clamping (bottom 40 deg gap: |deg| > 160)
          "if(Math.abs(deg)>160){return deg>0?180:-180;}"

          "var ang=Math.round((deg/160)*180);"
          "if(ang>180)ang=180;if(ang<-180)ang=-180;"
          "return ang;"
        "}"

        "function onDown(e){"
          "e.preventDefault();dragging=true;"
          "curAng=parseInt(num.value,10)||0;"
          "var a=getAngle(e);"
          "curAng=a;"
          "setDial(type,a);"
          "if(isRest)moveLive(a);"
          "hapticTick(a,lastHaptic);lastHaptic=a;"
        "}"
        "function onMove(e){"
          "if(!dragging)return;"
          "e.preventDefault();"
          "var a=getAngle(e);"
          "curAng=a;"
          "setDial(type,a);"
          "if(isRest)moveLive(a);"
          "hapticTick(a,lastHaptic);lastHaptic=a;"
        "}"
        "function onUp(e){dragging=false;}"

        "wrap.addEventListener('pointerdown',onDown);"
        "window.addEventListener('pointermove',onMove);"
        "window.addEventListener('pointerup',onUp);"
        "window.addEventListener('pointercancel',onUp);"

        "num.addEventListener('input',function(){"
          "this.style.width=((this.value.length+0.2)+'ch');"
          "var v=parseInt(this.value,10);"
          "if(!isNaN(v)){"
            "if(v>180)v=180;if(v<-180)v=-180;"
            "curAng=v;"
            "setDial(type,v);"
            "if(isRest)moveLive(v);"
            "hapticTick(v,lastHaptic);lastHaptic=v;"
          "}"
        "});"
        "num.addEventListener('change',function(){"
          "var v=parseInt(this.value,10);"
          "if(isNaN(v))v=0;if(v>180)v=180;if(v<-180)v=-180;"
          "this.value=v;this.style.width=(((''+v).length+0.2)+'ch');curAng=v;setDial(type,v);"
          "if(isRest)moveLive(v);"
        "});"
        "var b=num.parentElement;"
        "if(b){b.addEventListener('click',function(e){if(e.target!==num)num.focus();});}"
      "}"

      // Initialize dials
      "setDial('rest',savedRest);"
      "setDial('press',savedPress);"
      "bindDial('rest',true);"
      "bindDial('press',false);"

      // Revert to saved metrics handler with smooth animation
      "var revAnim=null;"
      "function animateRevert(){"
        "if(revAnim)cancelAnimationFrame(revAnim);"
        "var sRest=parseInt(rNum.value,10)||0;"
        "var sPress=parseInt(pNum.value,10)||0;"
        "var sDur=parseInt(dRng.value,10)||savedDur;"
        "var dRest=savedRest-sRest;"
        "var dPress=savedPress-sPress;"
        "var dDur=savedDur-sDur;"
        "if(dRest===0&&dPress===0&&dDur===0){"
          "__showToast('Already at saved metrics');"
          "return;"
        "}"
        "if(navigator.vibrate){try{navigator.vibrate(15);}catch(ex){}}"
        "var start=performance.now();"
        "var durMs=400;"
        "function step(now){"
          "var p=Math.min(1,(now-start)/durMs);"
          "var ease=1-Math.pow(1-p,3);"
          "var cRest=Math.round(sRest+dRest*ease);"
          "var cPress=Math.round(sPress+dPress*ease);"
          "var cDur=Math.round(sDur+dDur*ease);"
          "setDial('rest',cRest);"
          "setDial('press',cPress);"
          "dNum.value=cDur;dRng.value=cDur;"
          "updateSliderFill(cDur);"
          "if(p<1){"
            "revAnim=requestAnimationFrame(step);"
          "}else{"
            "revAnim=null;"
            "setDial('rest',savedRest);"
            "setDial('press',savedPress);"
            "dNum.value=savedDur;dRng.value=savedDur;"
            "updateSliderFill(savedDur);"
            "moveLive(savedRest);"
            "__showToast('Reverted to saved metrics');"
          "}"
        "}"
        "revAnim=requestAnimationFrame(step);"
      "}"
      "if(revertBtn){"
        "revertBtn.addEventListener('click',function(e){"
          "e.preventDefault();"
          "animateRevert();"
        "});"
      "}"

