psychoStark/ESP32-SwitchBot/main/calibration.h
      // Press Duration Sync & Haptics
      "dRng.addEventListener('input',function(){"
        "dNum.value=this.value;"
        "updateSliderFill(this.value);"
        "hapticTick(this.value,lastDHaptic);"
        "lastDHaptic=this.value;"
      "});"
      "dNum.addEventListener('input',function(){"
        "var v=parseInt(this.value,10);"
        "if(!isNaN(v)){"
          "if(v>3000)v=3000;if(v<50)v=50;"
          "dRng.value=v;"
          "updateSliderFill(v);"
        "}"
      "});"
      "dNum.addEventListener('change',function(){"
        "var v=parseInt(this.value,10);"
        "if(isNaN(v)||v<50)v=50;if(v>3000)v=3000;"
        "this.value=v;dRng.value=v;"
        "updateSliderFill(v);"
      "});"

      // Hold-to-press live logic
      "var isHolding=false;"
      "function onHoldStart(e){"
        "e.preventDefault();"
        "if(isHolding)return;"
        "isHolding=true;"
        "holdBtn.classList.add('holding');"
        "if(navigator.vibrate){try{navigator.vibrate(20);}catch(ex){}}"
        "var p=pNum.value;"
        "var r=rNum.value;"
        "fetch('/api/calibrate/hold?state=1&press='+p+'&rest='+r,{method:'POST'}).catch(function(){});"
      "}"
      "function onHoldEnd(e){"
        "if(!isHolding)return;"
        "isHolding=false;"
        "holdBtn.classList.remove('holding');"
        "if(navigator.vibrate){try{navigator.vibrate(12);}catch(ex){}}"
        "var r=rNum.value;"
        "fetch('/api/calibrate/hold?state=0&rest='+r,{method:'POST'}).catch(function(){});"
      "}"
      "holdBtn.addEventListener('pointerdown',onHoldStart);"
      "window.addEventListener('pointerup',onHoldEnd);"
      "window.addEventListener('pointercancel',onHoldEnd);"

      // Test tap button
      "testBtn.addEventListener('click',function(e){"
        "e.preventDefault();"
        "testBtn.disabled=true;"
        "if(navigator.vibrate){try{navigator.vibrate([25,20,25]);}catch(ex){}}"
        "__showToast('Testing tap...');"
        "var r=rNum.value;"
        "var p=pNum.value;"
        "var d=dNum.value||dRng.value;"
        "fetch('/api/calibrate/test?rest='+r+'&press='+p+'&dur='+d,{method:'POST'})"
        ".then(function(res){return res.text();})"
        ".then(function(t){__showToast('Tap test complete');})"
        ".catch(function(){__showToast('Test failed');})"
        ".finally(function(){testBtn.disabled=false;});"
      "});"

      // Save calibration button
      "saveBtn.addEventListener('click',function(e){"
        "e.preventDefault();"
        "saveBtn.disabled=true;"
        "if(navigator.vibrate){try{navigator.vibrate([30,30,50]);}catch(ex){}}"
        "__showToast('Saving...');"
        "var r=rNum.value;"
        "var p=pNum.value;"
        "var d=dNum.value||dRng.value;"
        "fetch('/api/calibrate/save?rest='+r+'&press='+p+'&dur='+d,{method:'POST'})"
        ".then(function(res){if(!res.ok)throw new Error('fail');return res.text();})"
        ".then(function(t){"
          "hasSaved=true;"
          "__showToast('Calibration Saved!');"
          "setTimeout(function(){window.location.href='/main';},1000);"
        "})"
        ".catch(function(){__showToast('Save failed');saveBtn.disabled=false;});"
      "});"

      // Reset calibration button
      "resetBtn.addEventListener('click',function(e){"
        "e.preventDefault();"
        "if(!confirm('Clear all calibration data and reset to factory defaults?'))return;"
        "resetBtn.disabled=true;"
        "if(navigator.vibrate){try{navigator.vibrate([20,40,20]);}catch(ex){}}"
        "__showToast('Resetting...');"
        "fetch('/api/calibrate/reset',{method:'POST'})"
        ".then(function(res){return res.text();})"
        ".then(function(t){"
          "hasSaved=true;"
          "__showToast('Calibration Reset');"
          "setTimeout(function(){window.location.reload();},1000);"
        "})"
        ".catch(function(){__showToast('Reset failed');resetBtn.disabled=false;});"
      "});"
    "}"
    "if(document.readyState==='loading'){document.addEventListener('DOMContentLoaded',initCal);}"
    "else{initCal();}"
    "})();"
    "</script>"
  );

  calScript.replace("{{REST}}", String(curRest));
  calScript.replace("{{PRESS}}", String(curPress));
  calScript.replace("{{DUR}}", String(curDur));

  return wrapPage("Servo Calibration", "&#127919;", body.c_str(), calScript.c_str());
}

/**
 * @brief Register HTTP route handlers for calibration
 */
inline void registerCalibrationRoutes(WebServer &server) {
  // GET /calibrate -> Serves web page or cURL bash script
  server.on("/calibrate", HTTP_GET, [&server]() {
    server.sendHeader("Connection", "close");
    if (server.header("User-Agent").indexOf("curl") >= 0) {
      String host = server.header("Host");
      if (host.length() == 0) host = "esp32.local";
      String script = generateCurlCalibrateScript(host);
      server.send(200, "text/plain; charset=utf-8", script);
    } else {
      String page = generateCalibratePage(restAngle, pressAngle, pressDurationMs, isCalibrated);
      server.send(200, "text/html; charset=utf-8", page);
    }
  });

  // POST /api/calibrate/move?angle=X
  server.on("/api/calibrate/move", HTTP_POST, [&server]() {
    int angle = server.hasArg("angle") ? server.arg("angle").toInt() : restAngle;
    if (angle >= -180 && angle <= 180) {
      myservo.attach(servoPin, 500, 2400);
      myservo.write(angle);
      delay(200);
      myservo.detach();
      server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "Moved");
    } else {
      server.sendHeader("Connection", "close");
      server.send(400, "text/plain", "Invalid angle");
    }
  });

  // POST /api/calibrate/hold?state=1|0&press=X&rest=Y
  server.on("/api/calibrate/hold", HTTP_POST, [&server]() {
    int state = server.hasArg("state") ? server.arg("state").toInt() : 0;
    int p = server.hasArg("press") ? server.arg("press").toInt() : pressAngle;
    int r = server.hasArg("rest") ? server.arg("rest").toInt() : restAngle;

    if (state == 1) {
      myservo.attach(servoPin, 500, 2400);
      myservo.write(p);
      server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "Holding");
    } else {
      myservo.write(r);
      delay(300);
      myservo.detach();
      server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "Released");
    }
  });

  // POST /api/calibrate/test?rest=X&press=Y&dur=Z
  server.on("/api/calibrate/test", HTTP_POST, [&server]() {
    int r = server.hasArg("rest") ? server.arg("rest").toInt() : restAngle;
    int p = server.hasArg("press") ? server.arg("press").toInt() : pressAngle;
    int d = server.hasArg("dur") ? server.arg("dur").toInt() : (server.hasArg("duration") ? server.arg("duration").toInt() : pressDurationMs);

    myservo.attach(servoPin, 500, 2400);
    myservo.write(p);
    delay(d);
    myservo.write(r);
    delay(300);
    myservo.detach();

    server.sendHeader("Connection", "close");
    server.send(200, "text/plain", "Tap completed");
  });

  // POST /api/calibrate/save?rest=X&press=Y&dur=Z
  server.on("/api/calibrate/save", HTTP_POST, [&server]() {
    int r = server.hasArg("rest") ? server.arg("rest").toInt() : restAngle;
    int p = server.hasArg("press") ? server.arg("press").toInt() : pressAngle;
    int d = server.hasArg("dur") ? server.arg("dur").toInt() : (server.hasArg("duration") ? server.arg("duration").toInt() : pressDurationMs);

    if (saveCalibration(r, p, d)) {
      server.sendHeader("Connection", "close");
      server.send(200, "text/plain", "Saved");
    } else {
      server.sendHeader("Connection", "close");
      server.send(400, "text/plain", "Invalid parameters");
    }
  });

  // POST /api/calibrate/reset
  server.on("/api/calibrate/reset", HTTP_POST, [&server]() {
    resetCalibration();
    server.sendHeader("Connection", "close");
    server.send(200, "text/plain", "Reset complete");
  });
}
